zhaojianzhao/STM32103-107/LTC中央系统板GIT/STM32107/MDK-ARM/user_file/user_time.c
#include "stm32f1xx_hal.h"
#include "user_config.h"
#include "user_time.h"

static uint8_t timer2_enable_can_sent_flag=0;
static uint8_t timer4_enable_heart_beat_flag=0;
void user_time_init(void)
{ 
	HAL_TIM_Base_Start_IT(&htim2);
	HAL_TIM_Base_Start_IT(&htim4);
}

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{   
	if(htim->Instance==TIM2)
	{
		SAFE(timer2_enable_can_sent_flag=1);  //50MS发送一次CAN的数据；
	}	
	/*2秒一次发送轮询的座椅信号*/
	if(htim->Instance==TIM4)
	{
		SAFE(timer4_enable_heart_beat_flag=1);  //使能发送“心跳”信号轮询；
	}		
}	
uint8_t get_timer4_enable_heart_beat_flag(void)
{
	uint8_t timer4_flag;
	SAFE(timer4_flag=timer4_enable_heart_beat_flag);
	return timer4_flag;
}

uint8_t get_timer2_enable_can_sent_flag(void)
{
	uint8_t timer2_flag;
	SAFE(timer2_flag=timer2_enable_can_sent_flag);
	return timer2_flag;
}

void clr_timer4_enable_heart_beat_flag(void)
{
	SAFE(timer4_enable_heart_beat_flag=0);
}

void clr_timer2_enable_can_sent_flag(void)
{
	SAFE(timer2_enable_can_sent_flag=0);
}

